// #1
// დაწერეთ ფუნქცია რომელსაც გადასცემთ წინადადებას და ციფრს
// მაგალითად fn("გამარჯობა, როგორ ხარ?", 5)
// ფუნქციამ უნდა შეამოკლოს ხუთი სიმბოლო და დაამატოს ბოლოში "..."
// და დააბრუნოს შედეგი "გამარ..."

function shortenStr (stri, numb) {
    let dots = "..."
    return stri.slice(0, numb) + dots
}
console.log(shortenStr("gamarjobaa", 3))


// #2
// დაწერეთ ფუნქცია რომელსაც გადასცემთ ციფრების მასივს
// ფუნქციამ უნდა დააბრუნოს მასივში მარტივი რიცხვების ჯამი
// მაგალითად fn([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
// მარტივი არის ციფრი რომელიც იყოფა მხოლოდ 1-ზე და თავის თავზე


// #3

function telNumber (num, country) {
    if(country == "GE"){
        console.log("+995"+num, country)
    } else if(country == "US"){
        console.log("+1(995)"+num, country)
    } else if(country == "RU"){
        console.log("+7(995)"+num, country)
    } else{
        console.log("არ ვიცით ქვეყანა")
    }
}
telNumber(3767575, "US")


// #4

function uniqueArray () {
    let array = [1, 1, 2, 2, 3, 3, 4, 4, 5, 5, 6, 6, 7, 7];
    let unArray = [];
    for(let i = 0; i<array.length; i++){
        if(!unArray.includes(array[i])){
            unArray.push(array[i])
        }
    }
    return unArray
}
console.log(uniqueArray())


// #5
// დაწერეთ ბანკომატის ფუნქციონალი რომელსაც გადასცემთ ციფრს
// ბანკომატში გვაქვს 200 , 100 , 50, 20, 10, 5 ლარიანი კუპიურები
// ფუნქციამ უნდა გვითხრას რამდენ ცალს და რამდენ ლარიან კუპიურად
// დაგვიშლის ჩვენს თანხას
// მაგალითად თუ ვეტყვით რომ გვინდა 555 ლარი
// ფუნქციამ უნდა დაგვიბრუნოს
// 2 ცალი 200 ლარიანი
// 1 ცალი 100 ლარიანი
// 1 ცალი 50 ლარიანი
// 1 ცალი 5 ლარიანი


